package store

import "http-rest-api/internal/app/model"

// ------------------------------------------------------------------------------------------------
// ------------------------------------------------------------------------------------------------

// UserRepository - тип структуры хранилища данных
type UserRepository struct {
	store *Store
}

// ------------------------------------------------------------------------------------------------
// ------------------------------------------------------------------------------------------------

// NewUserRepository - конструктор нового инстанса репозитория UserRepository
func (r *UserRepository) Create(u *model.User) (*model.User, error) {
	return nil, nil
}

// ------------------------------------------------------------------------------------------------
// ------------------------------------------------------------------------------------------------

// FindByEmail - метод репозитория UserRepository, который ищет пользователя по email
func (r *UserRepository) FindByEmail(email string) (*model.User, error) {
	return nil, nil
}
